Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
data (InputLayer)               (None, None, None, 3 0                                            
__________________________________________________________________________________________________
bn_data (BatchNormalization)    (None, None, None, 3 9           data[0][0]                       
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, None, None, 3 0           bn_data[0][0]                    
__________________________________________________________________________________________________
conv0 (Conv2D)                  (None, None, None, 6 9408        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
bn0 (BatchNormalization)        (None, None, None, 6 256         conv0[0][0]                      
__________________________________________________________________________________________________
relu0 (Activation)              (None, None, None, 6 0           bn0[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, None, None, 6 0           relu0[0][0]                      
__________________________________________________________________________________________________
pooling0 (MaxPooling2D)         (None, None, None, 6 0           zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn1 (BatchNormaliz (None, None, None, 6 256         pooling0[0][0]                   
__________________________________________________________________________________________________
stage1_unit1_relu1 (Activation) (None, None, None, 6 0           stage1_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, None, None, 6 0           stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv1 (Conv2D)     (None, None, None, 6 36864       zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn2 (BatchNormaliz (None, None, None, 6 256         stage1_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_relu2 (Activation) (None, None, None, 6 0           stage1_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, None, None, 6 0           stage1_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv2 (Conv2D)     (None, None, None, 6 36864       zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
stage1_unit1_sc (Conv2D)        (None, None, None, 6 4096        stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, None, 6 0           stage1_unit1_conv2[0][0]         
                                                                 stage1_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage1_unit2_bn1 (BatchNormaliz (None, None, None, 6 256         add_1[0][0]                      
__________________________________________________________________________________________________
stage1_unit2_relu1 (Activation) (None, None, None, 6 0           stage1_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, None, None, 6 0           stage1_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv1 (Conv2D)     (None, None, None, 6 36864       zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
stage1_unit2_bn2 (BatchNormaliz (None, None, None, 6 256         stage1_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_relu2 (Activation) (None, None, None, 6 0           stage1_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, None, None, 6 0           stage1_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv2 (Conv2D)     (None, None, None, 6 36864       zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, None, 6 0           stage1_unit2_conv2[0][0]         
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_bn1 (BatchNormaliz (None, None, None, 6 256         add_2[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_relu1 (Activation) (None, None, None, 6 0           stage2_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, None, None, 6 0           stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv1 (Conv2D)     (None, None, None, 1 73728       zero_padding2d_7[0][0]           
__________________________________________________________________________________________________
stage2_unit1_bn2 (BatchNormaliz (None, None, None, 1 512         stage2_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_relu2 (Activation) (None, None, None, 1 0           stage2_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, None, None, 1 0           stage2_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv2 (Conv2D)     (None, None, None, 1 147456      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
stage2_unit1_sc (Conv2D)        (None, None, None, 1 8192        stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, None, 1 0           stage2_unit1_conv2[0][0]         
                                                                 stage2_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage2_unit2_bn1 (BatchNormaliz (None, None, None, 1 512         add_3[0][0]                      
__________________________________________________________________________________________________
stage2_unit2_relu1 (Activation) (None, None, None, 1 0           stage2_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, None, None, 1 0           stage2_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv1 (Conv2D)     (None, None, None, 1 147456      zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
stage2_unit2_bn2 (BatchNormaliz (None, None, None, 1 512         stage2_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_relu2 (Activation) (None, None, None, 1 0           stage2_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, None, None, 1 0           stage2_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv2 (Conv2D)     (None, None, None, 1 147456      zero_padding2d_10[0][0]          
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, None, 1 0           stage2_unit2_conv2[0][0]         
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_bn1 (BatchNormaliz (None, None, None, 1 512         add_4[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_relu1 (Activation) (None, None, None, 1 0           stage3_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, None, None, 1 0           stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv1 (Conv2D)     (None, None, None, 2 294912      zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
stage3_unit1_bn2 (BatchNormaliz (None, None, None, 2 1024        stage3_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_relu2 (Activation) (None, None, None, 2 0           stage3_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, None, None, 2 0           stage3_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv2 (Conv2D)     (None, None, None, 2 589824      zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
stage3_unit1_sc (Conv2D)        (None, None, None, 2 32768       stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_5 (Add)                     (None, None, None, 2 0           stage3_unit1_conv2[0][0]         
                                                                 stage3_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage3_unit2_bn1 (BatchNormaliz (None, None, None, 2 1024        add_5[0][0]                      
__________________________________________________________________________________________________
stage3_unit2_relu1 (Activation) (None, None, None, 2 0           stage3_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, None, None, 2 0           stage3_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv1 (Conv2D)     (None, None, None, 2 589824      zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
stage3_unit2_bn2 (BatchNormaliz (None, None, None, 2 1024        stage3_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_relu2 (Activation) (None, None, None, 2 0           stage3_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, None, None, 2 0           stage3_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv2 (Conv2D)     (None, None, None, 2 589824      zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
add_6 (Add)                     (None, None, None, 2 0           stage3_unit2_conv2[0][0]         
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
stage4_unit1_bn1 (BatchNormaliz (None, None, None, 2 1024        add_6[0][0]                      
__________________________________________________________________________________________________
stage4_unit1_relu1 (Activation) (None, None, None, 2 0           stage4_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, None, None, 2 0           stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv1 (Conv2D)     (None, None, None, 5 1179648     zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
stage4_unit1_bn2 (BatchNormaliz (None, None, None, 5 2048        stage4_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_relu2 (Activation) (None, None, None, 5 0           stage4_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, None, None, 5 0           stage4_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv2 (Conv2D)     (None, None, None, 5 2359296     zero_padding2d_16[0][0]          
__________________________________________________________________________________________________
stage4_unit1_sc (Conv2D)        (None, None, None, 5 131072      stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_7 (Add)                     (None, None, None, 5 0           stage4_unit1_conv2[0][0]         
                                                                 stage4_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage4_unit2_bn1 (BatchNormaliz (None, None, None, 5 2048        add_7[0][0]                      
__________________________________________________________________________________________________
stage4_unit2_relu1 (Activation) (None, None, None, 5 0           stage4_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_17 (ZeroPadding2 (None, None, None, 5 0           stage4_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv1 (Conv2D)     (None, None, None, 5 2359296     zero_padding2d_17[0][0]          
__________________________________________________________________________________________________
stage4_unit2_bn2 (BatchNormaliz (None, None, None, 5 2048        stage4_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_relu2 (Activation) (None, None, None, 5 0           stage4_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_18 (ZeroPadding2 (None, None, None, 5 0           stage4_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv2 (Conv2D)     (None, None, None, 5 2359296     zero_padding2d_18[0][0]          
__________________________________________________________________________________________________
add_8 (Add)                     (None, None, None, 5 0           stage4_unit2_conv2[0][0]         
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, None, None, 5 2048        add_8[0][0]                      
__________________________________________________________________________________________________
relu1 (Activation)              (None, None, None, 5 0           bn1[0][0]                        
__________________________________________________________________________________________________
decoder_stage0_upsampling (UpSa (None, None, None, 5 0           relu1[0][0]                      
__________________________________________________________________________________________________
decoder_stage0_concat (Concaten (None, None, None, 7 0           decoder_stage0_upsampling[0][0]  
                                                                 stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage0a_conv (Conv2D)   (None, None, None, 2 1769472     decoder_stage0_concat[0][0]      
__________________________________________________________________________________________________
decoder_stage0a_bn (BatchNormal (None, None, None, 2 1024        decoder_stage0a_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage0a_relu (Activatio (None, None, None, 2 0           decoder_stage0a_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage0b_conv (Conv2D)   (None, None, None, 2 589824      decoder_stage0a_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage0b_bn (BatchNormal (None, None, None, 2 1024        decoder_stage0b_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage0b_relu (Activatio (None, None, None, 2 0           decoder_stage0b_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage1_upsampling (UpSa (None, None, None, 2 0           decoder_stage0b_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage1_concat (Concaten (None, None, None, 3 0           decoder_stage1_upsampling[0][0]  
                                                                 stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage1a_conv (Conv2D)   (None, None, None, 1 442368      decoder_stage1_concat[0][0]      
__________________________________________________________________________________________________
decoder_stage1a_bn (BatchNormal (None, None, None, 1 512         decoder_stage1a_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage1a_relu (Activatio (None, None, None, 1 0           decoder_stage1a_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage1b_conv (Conv2D)   (None, None, None, 1 147456      decoder_stage1a_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage1b_bn (BatchNormal (None, None, None, 1 512         decoder_stage1b_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage1b_relu (Activatio (None, None, None, 1 0           decoder_stage1b_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage2_upsampling (UpSa (None, None, None, 1 0           decoder_stage1b_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage2_concat (Concaten (None, None, None, 1 0           decoder_stage2_upsampling[0][0]  
                                                                 stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage2a_conv (Conv2D)   (None, None, None, 6 110592      decoder_stage2_concat[0][0]      
__________________________________________________________________________________________________
decoder_stage2a_bn (BatchNormal (None, None, None, 6 256         decoder_stage2a_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage2a_relu (Activatio (None, None, None, 6 0           decoder_stage2a_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage2b_conv (Conv2D)   (None, None, None, 6 36864       decoder_stage2a_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage2b_bn (BatchNormal (None, None, None, 6 256         decoder_stage2b_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage2b_relu (Activatio (None, None, None, 6 0           decoder_stage2b_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage3_upsampling (UpSa (None, None, None, 6 0           decoder_stage2b_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage3_concat (Concaten (None, None, None, 1 0           decoder_stage3_upsampling[0][0]  
                                                                 relu0[0][0]                      
__________________________________________________________________________________________________
decoder_stage3a_conv (Conv2D)   (None, None, None, 3 36864       decoder_stage3_concat[0][0]      
__________________________________________________________________________________________________
decoder_stage3a_bn (BatchNormal (None, None, None, 3 128         decoder_stage3a_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage3a_relu (Activatio (None, None, None, 3 0           decoder_stage3a_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage3b_conv (Conv2D)   (None, None, None, 3 9216        decoder_stage3a_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage3b_bn (BatchNormal (None, None, None, 3 128         decoder_stage3b_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage3b_relu (Activatio (None, None, None, 3 0           decoder_stage3b_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage4_upsampling (UpSa (None, None, None, 3 0           decoder_stage3b_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage4a_conv (Conv2D)   (None, None, None, 1 4608        decoder_stage4_upsampling[0][0]  
__________________________________________________________________________________________________
decoder_stage4a_bn (BatchNormal (None, None, None, 1 64          decoder_stage4a_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage4a_relu (Activatio (None, None, None, 1 0           decoder_stage4a_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage4b_conv (Conv2D)   (None, None, None, 1 2304        decoder_stage4a_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage4b_bn (BatchNormal (None, None, None, 1 64          decoder_stage4b_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage4b_relu (Activatio (None, None, None, 1 0           decoder_stage4b_bn[0][0]         
__________________________________________________________________________________________________
final_conv (Conv2D)             (None, None, None, 1 145         decoder_stage4b_relu[0][0]       
__________________________________________________________________________________________________
sigmoid (Activation)            (None, None, None, 1 0           final_conv[0][0]                 
==================================================================================================
Total params: 14,340,570
Trainable params: 14,330,644
Non-trainable params: 9,926



Epoch 1/50
75/75 [==============================] - 151s 2s/step - loss: 0.8670 - iou_score: 0.1960 - f1-score: 0.3077 - val_loss: 0.8127 - val_iou_score: 0.2946 - val_f1-score: 0.4423
Epoch 2/50
75/75 [==============================] - 130s 2s/step - loss: 0.8065 - iou_score: 0.2513 - f1-score: 0.3736 - val_loss: 0.6965 - val_iou_score: 0.3106 - val_f1-score: 0.4608
Epoch 3/50
75/75 [==============================] - 130s 2s/step - loss: 0.7680 - iou_score: 0.2678 - f1-score: 0.3922 - val_loss: 0.5596 - val_iou_score: 0.3729 - val_f1-score: 0.5235
Epoch 4/50
75/75 [==============================] - 131s 2s/step - loss: 0.7506 - iou_score: 0.2685 - f1-score: 0.3956 - val_loss: 0.6223 - val_iou_score: 0.3618 - val_f1-score: 0.5222
Epoch 5/50
75/75 [==============================] - 131s 2s/step - loss: 0.7181 - iou_score: 0.2897 - f1-score: 0.4206 - val_loss: 0.6244 - val_iou_score: 0.3342 - val_f1-score: 0.4887
Epoch 6/50
75/75 [==============================] - 131s 2s/step - loss: 0.7102 - iou_score: 0.2925 - f1-score: 0.4220 - val_loss: 0.6382 - val_iou_score: 0.2715 - val_f1-score: 0.4241
Epoch 7/50
75/75 [==============================] - 132s 2s/step - loss: 0.6726 - iou_score: 0.3219 - f1-score: 0.4571 - val_loss: 0.5270 - val_iou_score: 0.3857 - val_f1-score: 0.5470
Epoch 8/50
75/75 [==============================] - 131s 2s/step - loss: 0.6981 - iou_score: 0.2894 - f1-score: 0.4229 - val_loss: 0.4731 - val_iou_score: 0.3891 - val_f1-score: 0.5487
Epoch 9/50
75/75 [==============================] - 131s 2s/step - loss: 0.6641 - iou_score: 0.3226 - f1-score: 0.4565 - val_loss: 0.3330 - val_iou_score: 0.4662 - val_f1-score: 0.6049
Epoch 10/50
75/75 [==============================] - 131s 2s/step - loss: 0.6622 - iou_score: 0.3176 - f1-score: 0.4536 - val_loss: 0.3749 - val_iou_score: 0.4900 - val_f1-score: 0.6431
Epoch 11/50
75/75 [==============================] - 131s 2s/step - loss: 0.6463 - iou_score: 0.3196 - f1-score: 0.4605 - val_loss: 0.4842 - val_iou_score: 0.3914 - val_f1-score: 0.5497
Epoch 12/50
75/75 [==============================] - 132s 2s/step - loss: 0.6444 - iou_score: 0.3329 - f1-score: 0.4670 - val_loss: 0.5573 - val_iou_score: 0.3701 - val_f1-score: 0.5299
Epoch 13/50
75/75 [==============================] - 131s 2s/step - loss: 0.6165 - iou_score: 0.3552 - f1-score: 0.4950 - val_loss: 0.4700 - val_iou_score: 0.3950 - val_f1-score: 0.5505
Epoch 14/50
75/75 [==============================] - 132s 2s/step - loss: 0.6119 - iou_score: 0.3571 - f1-score: 0.4955 - val_loss: 0.2929 - val_iou_score: 0.4959 - val_f1-score: 0.6346
Epoch 15/50
75/75 [==============================] - 132s 2s/step - loss: 0.6124 - iou_score: 0.3504 - f1-score: 0.4910 - val_loss: 0.5221 - val_iou_score: 0.3517 - val_f1-score: 0.5088
Epoch 16/50
75/75 [==============================] - 132s 2s/step - loss: 0.5988 - iou_score: 0.3674 - f1-score: 0.5056 - val_loss: 0.3779 - val_iou_score: 0.4298 - val_f1-score: 0.5844
Epoch 17/50
75/75 [==============================] - 132s 2s/step - loss: 0.5871 - iou_score: 0.3799 - f1-score: 0.5140 - val_loss: 0.7003 - val_iou_score: 0.3126 - val_f1-score: 0.4637
Epoch 18/50
75/75 [==============================] - 133s 2s/step - loss: 0.5946 - iou_score: 0.3641 - f1-score: 0.5030 - val_loss: 0.3483 - val_iou_score: 0.4522 - val_f1-score: 0.5912
Epoch 19/50
75/75 [==============================] - 132s 2s/step - loss: 0.5862 - iou_score: 0.3702 - f1-score: 0.5140 - val_loss: 0.3183 - val_iou_score: 0.4791 - val_f1-score: 0.6173
Epoch 20/50
75/75 [==============================] - 133s 2s/step - loss: 0.5721 - iou_score: 0.3866 - f1-score: 0.5236 - val_loss: 0.4377 - val_iou_score: 0.4204 - val_f1-score: 0.5785
Epoch 21/50
75/75 [==============================] - 132s 2s/step - loss: 0.5572 - iou_score: 0.4015 - f1-score: 0.5394 - val_loss: 0.4467 - val_iou_score: 0.3795 - val_f1-score: 0.5373
Epoch 22/50
75/75 [==============================] - 132s 2s/step - loss: 0.5631 - iou_score: 0.3913 - f1-score: 0.5288 - val_loss: 0.4630 - val_iou_score: 0.4171 - val_f1-score: 0.5746
Epoch 23/50
75/75 [==============================] - 132s 2s/step - loss: 0.5631 - iou_score: 0.3978 - f1-score: 0.5365 - val_loss: 0.4085 - val_iou_score: 0.4277 - val_f1-score: 0.5810
Epoch 24/50
75/75 [==============================] - 132s 2s/step - loss: 0.5637 - iou_score: 0.3900 - f1-score: 0.5286 - val_loss: 0.4734 - val_iou_score: 0.3991 - val_f1-score: 0.5455
Epoch 25/50
75/75 [==============================] - 133s 2s/step - loss: 0.5308 - iou_score: 0.4281 - f1-score: 0.5617 - val_loss: 0.3098 - val_iou_score: 0.4746 - val_f1-score: 0.6228
Epoch 26/50
75/75 [==============================] - 132s 2s/step - loss: 0.5033 - iou_score: 0.4598 - f1-score: 0.5922 - val_loss: 0.3115 - val_iou_score: 0.4732 - val_f1-score: 0.6239
Epoch 27/50
75/75 [==============================] - 132s 2s/step - loss: 0.5055 - iou_score: 0.4438 - f1-score: 0.5822 - val_loss: 0.3420 - val_iou_score: 0.4713 - val_f1-score: 0.6223
Epoch 28/50
75/75 [==============================] - 133s 2s/step - loss: 0.5058 - iou_score: 0.4504 - f1-score: 0.5837 - val_loss: 0.2928 - val_iou_score: 0.4910 - val_f1-score: 0.6397
Epoch 29/50
75/75 [==============================] - 132s 2s/step - loss: 0.5015 - iou_score: 0.4504 - f1-score: 0.5863 - val_loss: 0.2891 - val_iou_score: 0.4774 - val_f1-score: 0.6264
Epoch 30/50
75/75 [==============================] - 131s 2s/step - loss: 0.5110 - iou_score: 0.4391 - f1-score: 0.5750 - val_loss: 0.3235 - val_iou_score: 0.4629 - val_f1-score: 0.6128
Epoch 31/50
75/75 [==============================] - 132s 2s/step - loss: 0.4970 - iou_score: 0.4563 - f1-score: 0.5922 - val_loss: 0.3463 - val_iou_score: 0.4565 - val_f1-score: 0.6037
Epoch 32/50
75/75 [==============================] - 132s 2s/step - loss: 0.4719 - iou_score: 0.4829 - f1-score: 0.6150 - val_loss: 0.3374 - val_iou_score: 0.4668 - val_f1-score: 0.6201
Epoch 33/50
75/75 [==============================] - 133s 2s/step - loss: 0.4782 - iou_score: 0.4765 - f1-score: 0.6067 - val_loss: 0.2966 - val_iou_score: 0.4743 - val_f1-score: 0.6240
Epoch 34/50
75/75 [==============================] - 132s 2s/step - loss: 0.4765 - iou_score: 0.4784 - f1-score: 0.6101 - val_loss: 0.3163 - val_iou_score: 0.4679 - val_f1-score: 0.6182
Epoch 35/50
75/75 [==============================] - 133s 2s/step - loss: 0.4789 - iou_score: 0.4808 - f1-score: 0.6074 - val_loss: 0.3462 - val_iou_score: 0.4612 - val_f1-score: 0.6095
Epoch 36/50
75/75 [==============================] - 132s 2s/step - loss: 0.4662 - iou_score: 0.4822 - f1-score: 0.6159 - val_loss: 0.3205 - val_iou_score: 0.4589 - val_f1-score: 0.6077
Epoch 37/50
75/75 [==============================] - 131s 2s/step - loss: 0.4647 - iou_score: 0.4868 - f1-score: 0.6174 - val_loss: 0.2633 - val_iou_score: 0.4935 - val_f1-score: 0.6383
Epoch 38/50
75/75 [==============================] - 132s 2s/step - loss: 0.4526 - iou_score: 0.5015 - f1-score: 0.6302 - val_loss: 0.2982 - val_iou_score: 0.4863 - val_f1-score: 0.6339
Epoch 39/50
75/75 [==============================] - 132s 2s/step - loss: 0.4581 - iou_score: 0.4962 - f1-score: 0.6263 - val_loss: 0.3207 - val_iou_score: 0.4657 - val_f1-score: 0.6150
Epoch 40/50
75/75 [==============================] - 132s 2s/step - loss: 0.4650 - iou_score: 0.4877 - f1-score: 0.6160 - val_loss: 0.2698 - val_iou_score: 0.4902 - val_f1-score: 0.6366
Epoch 41/50
75/75 [==============================] - 132s 2s/step - loss: 0.4563 - iou_score: 0.5011 - f1-score: 0.6260 - val_loss: 0.2924 - val_iou_score: 0.4756 - val_f1-score: 0.6228
Epoch 42/50
75/75 [==============================] - 132s 2s/step - loss: 0.4432 - iou_score: 0.5117 - f1-score: 0.6388 - val_loss: 0.3026 - val_iou_score: 0.4697 - val_f1-score: 0.6175
Epoch 43/50
75/75 [==============================] - 132s 2s/step - loss: 0.4664 - iou_score: 0.4828 - f1-score: 0.6188 - val_loss: 0.3045 - val_iou_score: 0.4637 - val_f1-score: 0.6125
Epoch 44/50
75/75 [==============================] - 132s 2s/step - loss: 0.4469 - iou_score: 0.5045 - f1-score: 0.6334 - val_loss: 0.2728 - val_iou_score: 0.4786 - val_f1-score: 0.6246
Epoch 45/50

75/75 [==============================] - 132s 2s/step - loss: 0.4520 - iou_score: 0.5059 - f1-score: 0.6283 - val_loss: 0.2798 - val_iou_score: 0.4811 - val_f1-score: 0.6281
Epoch 46/50
75/75 [==============================] - 131s 2s/step - loss: 0.4147 - iou_score: 0.5337 - f1-score: 0.6647 - val_loss: 0.2843 - val_iou_score: 0.4784 - val_f1-score: 0.6264
Epoch 47/50
75/75 [==============================] - 131s 2s/step - loss: 0.4392 - iou_score: 0.5144 - f1-score: 0.6394 - val_loss: 0.3359 - val_iou_score: 0.4445 - val_f1-score: 0.5942
Epoch 48/50
75/75 [==============================] - 132s 2s/step - loss: 0.4350 - iou_score: 0.5149 - f1-score: 0.6445 - val_loss: 0.3000 - val_iou_score: 0.4685 - val_f1-score: 0.6166
Epoch 49/50
75/75 [==============================] - 131s 2s/step - loss: 0.4453 - iou_score: 0.5067 - f1-score: 0.6357 - val_loss: 0.2890 - val_iou_score: 0.4782 - val_f1-score: 0.6258
Epoch 50/50
75/75 [==============================] - 131s 2s/step - loss: 0.4401 - iou_score: 0.5157 - f1-score: 0.6401 - val_loss: 0.2940 - val_iou_score: 0.4755 - val_f1-score: 0.6229
